<?php
return [
    //呼叫方式
    'type' => collect([
        1 => 'APP',
        2 => '電話',
        3 => 'api',
        4 => '網頁',
        5 => 'Line',
        6 => '手鍵單',
        7 => '餐廳語音',
        8 => '餐廳貼紙App',
        9 => '餐廳貼紙Web',
        10 => '車廠',
    ]),

    //代駕方式
    'call_type' => collect([
        0 => '無',
        1 => '一般代駕',
        2 => '預約代駕',
        3 => '多位代駕',
        4 => '長途代駕',
        5 => '鐘點代駕',
    ]),

    //付款方式
    'pay_type' => collect([
        0 => '無',
        1 => '現金',
        2 => '信用卡',
        3 => '企業簽單',
        4 => '車廠',
        5 => 'Apple Pay',
    ]),

    //當 pay_typ 為車廠時的付款方式
    'car_factory_pay_type' => collect([
        1 => '現金',
        2 => '信用卡',
        3 => '企業簽單',
    ]),

    //任務狀態
    'TaskState' => collect([
        -1 => '媒合失敗',
        0 => '媒合中',
        1 => '駕駛確認中',
        2 => '駕駛前往中',
        3 => '駕駛已到達位置',
        4 => '行駛中',
        5 => '行駛暫停',
        6 => '到達目的',
        7 => '任務已完成',
    ]),

    //被誰取消
    'cancel_by' => collect([
        1 => '客人',
        2 => '駕駛',
        3 => '客服',
        4 => '車廠',
    ]),

    'car_factory_type' => collect([
        1 => '牽車',
        2 => '送車',
        3 => '牽車+送車',
        4 => '送代步車+取客人車',
        5 => '送客人車+取代步車',
    ]),

    'car_factory_status' => collect([
        1 => '已接',
        2 => '待接',
        3 => '異動',
    ]),
];
